# Ren'Py automatically loads all script files ending with .rpy. To use this
# file, define a label and jump to it from another file.

# 5월 3일 장터 이벤트

#이미지 선언
image gyobok = "gyobok.jpg"

# month5 week1 day2
label jangtuh:

    "오늘은 어쩔수 없이 수업을 못갔다.
    장터를 계속해서 총괄하는 사람이 선배 1명과 신입생 1명이 있어야하는데 뻔대인 내가 신입생 중 이 역할을 맡기로 했기 때문이다."
    "일찍부터 하는 장터 준비는 끝났고 장사를 시작했다."
    "점심시간까지는 학생들이 학교 캠퍼스에 별로 없었어서 그런지 바쁘지는 않았다."
    "하지만 이제 곧 대망의 점심시간! 사람들이 하나 둘 몰려오기 시작한다!"

    "진일" "이랏샤이마세~ 주문 뭘로 하실건가요??"
    "고객1" "저는 파전이랑 막걸리 하나씩이요!"
    "진일" "네~ 6000원이요~ 감사합니다! 다음이요!"
    "고객2" "저는 김치전 하나, 치킨너겟 하나, 그리고 막걸리 하나요~"
    "진일" "김치전, 치킨너겟, 막걸리 하나씩 해서 10,000원입니다. 넵 감사합니다!"

    "주인공" "와..진일이 너도 진짜 수고한다 ㅠㅠㅠ"
    "진일" "야 나 밖에 없지? 일찍 부터 도와주는 사람 거의 없네 ㅋㅋㅋ"
    "주인공" "애들 수업 때문에 다 바쁜가봐 ㅋㅋ"
    "진일" "누구는 수업 없냐~"
    "주인공" "ㅋㅋ"

    "삼용" "얘들아 나 왔어!!! 뭐하면 돼??"
    "주인공" "얼른 와!! 지금 요리하는 사람이 별로 없어서 주문이 밀리고 있어 ㅠㅠ \n 너가 요리 좀 해줘!"
    "삼용" "나만 믿어! 나 별명이 요리왕 삼룡이잖아 ㅋㅋㅋ"
    "진일" "알았으니까 빨리가서 일해"
    "삼용" "으...으응"

    "점심시간 이후로도 우리 장터에 사람들은 계속 많았다. 삼용이는 정말로 요리를 잘했다. 어디서 준비를 해온지는 모르겠지만 자신이 쓰던 웤을 들고 온 후 사람들이 보는 앞에서 불쇼도 하며 고객들을 더욱 끌어모았다. 장사가 잘 되는 것은 좋지만 일손이 부족해 수요에 맞춰 공급이 원활하게 진행되지 못했다."

    "진일" "아 애들 진짜 언제 오는거냐 바빠 죽겠는데"
    "삼용" "진일아 다음 메뉴!!!"
    "진일" "김치전 넷, 파전 다섯, 봉골레 하나 빨리빨리 안하냐~!"
    "삼용" "봉골레는 또 뭐야!!!"
    "진일" "아 몰랑 기획자들이 칠 드립이 없어서 그냥 넣었나봐"
    "삼용" "일단 알겠어!"
    "진일" "뻔대야 애들 진짜 안오냐?? 거의 우리 셋이서만 일하는데?"

    "장중" "잘 하고 있냐??"
    "주인공" "왜 이렇게 늦게 왔어 ㅠㅠㅠㅠ 얼른 가서 일 도와줘"
    "장중" "ㅋㅋㅋㅋ 잘 하고 있구만 왜"
    "주인공" "너 2시까지는 온다며… 벌써 3시야"
    "장중" "아 나 수업 끝나고 애들이랑 팀플하느라 늦었어 ㅠㅠ"
    "주인공" "하.. 알겠어 얼른 가서 진일이 도와줘"
    "장중" "나 뭐하면 돼?"
    "주인공" "지금 요리는 삼용이가 빨리빨리 잘해주고 있어서 괜찮은데
     /n 주문은 지금 워낙 많아서 진일이 혼자 감당하기 힘들어 ㅠㅠ 가서 얼른 진일이 도와줘"
    "장중" "오케이~"
    "진일" "야 해장중 너 빨리 와서 좀 도와"

    "장중이에 이어서 현재, 미래, 대현, 덕현이도 장터현장에 도착하기 시작했다. 사람이 많아져서 일찍부터 일한 진일, 삼용은 쉴 수 있었지만 나는 다른 친구들에게 일을 인수인계하느라 쉬지 못했다. 더불어 오후 4시부터는 고객들이 하나 둘 씩 줄어들면서 장터현장이 한가해졌다."

    "장중" "야 뻔대야 우리 이제 정리할까??"
    "진일" "너네들 일 얼마나 했다고 벌써 정리해"
    "대현" "근데 고객이 없으니까 정리해도 되지 않나??"
    "현재" "다 정리하지는 말고 메뉴판이랑 요리도구만 치워도 되지 않을까"
    "삼용" "그래도 사람들 더 올 수도 있으니까 6시까지는 놔두자"
    "덕현" "굳이…"
    "진일" "야. 솔직히 말해서 우리는 아침 일찍 손님 없을때부터 와서 계속 자리 지키고 일했는데 그럼 우리도 그때 치울걸 그랬네?"
    "주인공" "왜 그래 얘들아…"
    "삼용" "맞아 뻔대도 오늘 이거 하느라 고생많이 했어 ㅠㅠㅠ"
    "진일" "하…"
    "현재" "그렇네… 우리가 미안해 얘들아"
    "대현" "그런뜻으로 말 한게 아닌데… 미안해"
    "덕현" "고멘네…"
    "미래" "미안해 ㅠㅠㅠ 너네들 말이 맞아"
    "현재" "그래 우리 6시에 치우기 시작하자!"
    "대현" "그러자!"
    "미래" "좋아!"
    "덕현" "요시!"
    "진일" "쉬엄쉬엄 해…"
    "삼용" "조금만 더 수고해 ㅋㅋ"

    "갑자기 장중이가 일하다 말고 나한테 따로 와서 이야기를 한다."

    "장중" "뻔대야 우리 사람 진짜 안오는데 그냥 딴 장터 같이 갈래?
    /n 저녁도 안먹어서 배도 고프고 너도 오늘 일 많이 했는데 다른 장터 잠깐 가서 빠르게 먹고 올래? 지금 다른 장터도 끝날 시간이라 음식이랑 술도 엄청 싸게 파는것 같아 ㅋㅋㅋ"

    menu:
        "간다":

            "주인공" "그래 ㅋㅋ 우리 과 장터가 아직 끝나지는 않았지만 오늘 일을 열심히 했으니깐 잠깐 놀고 와도 괜찮지 않을까?"

            "장중" "오케이~ 역시 우리 뻔대!!!  가서 다른 장터 쓸어오자 ㅋㅋㅋ 거기서 술 싸게 팔면 사서 우리 애들이랑 같이 마시게 사오자. 애들도 개 좋아할듯!"

            "갑자기 전화가 울린다. 진일이에게 전화가 왔다."
            "진일" "야 너 어디냐? 이제 곧 정리 할려고 하는데 얼른 와."
            "주인공" "아 그래?? 헐 벌써 6시구나 알겠어 나 갈게!!"
            "진일" "해장중 얘는 또 어디갔냐… 혹시 둘이 지금 같이 있어?"
            "주인공" "아...어"
            "진일" "둘이서 어디 갔…"
            "주인공" "여보세요?"

            "진일이와 통화를 하다 갑자기 전화가 끊겼다. 불길한 예감이 들어 장중이에게 돌아가자고 할 무렵."

            "진일" "니들 여기 있었냐..?"

            "주인공" "어….어"
            "장중" "진일아 얼른 와 여기 장터 개 혜자야 ㅋㅋㅋㅋㅋ"

            "진일" "지금 나랑 장난쳐? 뭐하는거야 지금. 애들 다 우리 장터 정리하려고 도와주고 있는데 해장중 넌 여기서 뭐하냐? 뻔대는 오전부터 수고했으니까 그렇다쳐도 넌 여기서 놀면 안되는거 아니냐?"

            "장중" "아 알겠어 지금 가서 도와주면 되지 뭘 또 화를 내고 그래"

            "진일" "뻔대 너도 오늘 쉬고싶은건 이해하는데 그래도 해장중은 일하게 했어야지."

            "주인공" "미안…"

            "진일" "아 일단 모르겠고 우리 장터 가서 정리하는거 도와주기나 해"

            "주인공:응.."

            #장중 파라미터 급격히 오름"
            #진일 삼용 파라미터 내림"

        "안간다":

            "주인공" "아직 우리 과 장터가 안끝나서 지금 가기는 조금 그런데…"

            "장중" "아 뻔대 뭐냐~ 실망이네. 어짜피 장터에 사람도 안오고 정리할때 맞춰서 오면 애들한테 피해도 안주는건데…"

            "주인공" "미안 ㅠㅠ 그래도 혹시나 무슨일 생기면 총괄자가 있어야하니깐 나는 여기 있어야할 것 같아 ㅠㅠ"

            #장중 파라미터 내림

    "오후 6시가 되었다. 여러가지 우여곡절이 있었지만 결국 장터는 무사히 끝났다."

    #장터 뒷풀이"

    "장터현장을 정리하고 우리는 다같이 뒷풀이를 하러 술집에 왔다. 장터에 도와주지 못한 친구들도 하나 둘씩 나타나며 뒷풀이에 참가하여 꽤 많은 인원이 모였다."

    "진일" "자자 주목~! 오늘 뻔대가 우리 학번중에 가장 열심히 일 했으니까 건배사 한답니다!!!"

    "현재" "올~~~~~"
    "장중" "뻔대 멋있다!!!"
    "미래" "와!!!!"
    "삼용" "한마디 해라!!!"
    "모두" "뻔대! 뻔대! 뻔대!"

    "주인공" "오늘 모두 수고했고 열심히 번 돈으로 방학 때 좋은 곳으로 MT나 한번 더 가자!!! 자 문정과 하면 화이팅!"

    "주인공" "문정과!!!"

    "모두" "화이팅!!!!!!"

    "진일" "뻔대야 진짜 수고했다 ㅋㅋㅋ 너, 나 그리고 삼용이 아침부터 하느라 힘들었는데 마시고 죽자"

    "삼용" "내일 수요일이야 ㅋㅋㅋ 우리 죽으면 안돼"

    "장중" "ㅋㅋㅋ 맞아 역시 일하고 마시는 술은 꿀맛이다!"

    "진일" "넌 나중에 사람 없을 때 와서 개꿀 빨았잖아~ 그래서 술이 꿀맛인건가??"

    "장중" "야 그래도 정리할때 일 개많이 했거든?"

    "진일" "응 그것도 점심 때에 비하면 아무것도 아님~"

    "주인공" "ㅋㅋㅋ 모두 다 수고했어 얘들아"

    "장중이가 말한것 처럼 일하고 마신 술은 예상외로 진짜 맛있었다."
    "아침 일찍부터 저녁까지 일하고 술을 마신것은 처음이라서 그런가?"
    "나 말고 모두 다 그렇게 느꼈던 건지 예상외로 술자리가 길어지고 술값은 늘어났다."
    "아 모르겠다. 그래도 이번 학기 큰 행사가 막이 내려서 다행이다."
