# #엔딩 스크립트
# label ending:
#
#     "" "지난 3개월, 몸과 마음이 지쳐가며 열심히 살아온 당신, 괜찮았나요?\n"
#     extend 당신은 병원에 ____ 번 입원하고,
#     extend _____번 집에 다녀오셨습니다.
#
#     #전체 파라미터
#     "" "공부 ______했고/했지만 ______ 했습니다.\n"
#     extend "동아리  ______했고/했지만 ______ 했습니다."
#
#     "" "과생활 ______했고/했지만 ______ 했습니다."
#
#
#     #개인 파라미터
#     "" "장중이와는 ________사이가 됐고\n"
#     extend "진일이와는 ________ 사이\n"
#     extend "삼용이와는 ________ 사이\n"
#     extend "동아와는 ________ 사이가 됐습니다."
#
#     고생했습니다. 분명 아쉽고 왜 이렇게 잘 하지 못했을까 자신을 탓할지도 모릅니다.
#     하지만, 누구에게나 처음은 어렵지요. 그 어려움을 이겨내고 지금에 이른 당신.
#     진심을 담아 너무나 수고하셨습니다. 다음에 겪게 될 처음들도 잘 이겨낼거에요.
#     행운을 빕니다.
